app/controllers/projects_controller.rb

SELECT * FROM `projects`
---
  def index
    @projects = Project.all

SELECT * FROM `projects` WHERE (`projects`.`id` = 3)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM `projects` WHERE (`projects`.`id` = 3)
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("name", "updated_at", "description", "created_at") VALUES('eplamtax', '2009-03-22 18:29:25', 'Projeto de desenvolvimento de sistema de viagens internacionais da força aérea brasileira. ', '2009-03-22 18:29:25')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `updated_at` = '2009-05-15 13:32:48', `description` = 'Esse é um projeto legal muito legal mesmo!' WHERE `id` = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy