app/controllers/project_memberships_controller.rb

SELECT * FROM `project_memberships` WHERE (`project_memberships`.`id` = 585145678)
---
  def show
    @project_membership = ProjectMembership.find(params[:id])

SELECT `projects`.* FROM `projects` INNER JOIN `project_memberships` ON `projects`.id = `project_memberships`.project_id WHERE ((`project_memberships`.user_id = 1) AND ((leaved is null)))
---
  def new
    @project_membership = ProjectMembership.new
    @project_membership.project = Project.find(params[:project_id])

INSERT INTO `project_memberships` (`created_at`, `joined`, `leaved`, `project_id`, `updated_at`, `user_id`) VALUES('2009-05-15 02:38:17', '2009-05-14', NULL, 3, '2009-05-15 02:38:17', 1)
---
  def create
    @project_membership = ProjectMembership.new(params[:project_membership])

    respond_to do |format|
      if @project_membership.save