app/controllers/summary_reports_controller.rb

  def show
    @summary_report = SummaryReport.find(params[:id])
---
SELECT * FROM `summary_reports` WHERE (`summary_reports`.`id` = 1)

  def new
    @summary_report = SummaryReport.new
    @projects = Project.find :all
    @users = User.find :all
---
SELECT * FROM `projects`
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
    @summary_report = SummaryReport.new(params[:summary_report])

    respond_to do |format|
      if @summary_report.save
---
INSERT INTO `summary_reports` (`created_at`, `project_id`, `updated_at`, `task_type_id`, `user_id`) VALUES('2009-05-15 02:38:45', 3, '2009-05-15 02:38:45', NULL, NULL)