app/controllers/task_types_controller.rb

SELECT * FROM `task_types` WHERE (`task_types`.`project_id` = '1')
---
  def index
    @task_types = TaskType.find_all_by_project_id params[:project_id]

SELECT `projects`.* FROM `projects` INNER JOIN `project_memberships` ON `projects`.id = `project_memberships`.project_id WHERE ((`project_memberships`.user_id = 1) AND ((leaved is null)))
---
  def new
    @task_type = TaskType.new
    @task_type.project = Project.find(params[:project_id])

SELECT * FROM `task_types` WHERE (`task_types`.`id` = 3)
---
  def edit
    @task_type = TaskType.find(params[:id])

INSERT INTO "task_types" ("name", "project_id", "updated_at", "created_at") VALUES('tarefa 1', 2, '2009-04-07 02:13:31', '2009-04-07 02:13:31')
---
  def create
    @task_type = TaskType.new(params[:task_type])

    respond_to do |format|
      if @task_type.save

SELECT * FROM `task_types` WHERE (`task_types`.`id` = 3)
UPDATE "task_types" SET "name" = 'Outro nome', "updated_at" = '2009-04-22 16:51:09' WHERE "id" = 1
---
  def update
    @task_type = TaskType.find(params[:id])

    respond_to do |format|
      if @task_type.update_attributes(params[:task_type])

SELECT * FROM "task_types" WHERE ("task_types"."id" = 1)
DELETE FROM "task_types" WHERE "id" = 1
---
  def destroy
    @task_type = TaskType.find(params[:id])
    project = @task_type.project
    @task_type.destroy