app/controllers/time_logs_controller.rb

  def edit
    @time_log = TimeLog.find(params[:id])
---
SELECT * FROM `time_logs` WHERE (`time_logs`.`id` = 953125641)

  def create
    @time_log = TimeLog.new(params[:time_log])

    respond_to do |format|
      if @time_log.save
---
INSERT INTO "time_logs" ("worked_hours", "updated_at", "task_type_id", "description", "user_id", "task_date", "created_at") VALUES('2009-04-12 19:28:00', '2009-04-12 19:29:06', 1, 'descrição de serviço!', 1, '2009-04-12', '2009-04-12 19:29:06')

  def update
    @time_log = TimeLog.find(params[:id])

    respond_to do |format|
      if @time_log.update_attributes(params[:time_log])
---
SELECT * FROM `time_logs` WHERE (`time_logs`.`id` = 953125641)
UPDATE `time_logs` SET `updated_at` = '2009-05-15 11:12:09', `task_type_id` = 3, `worked_hours` = '2000-01-01 05:00:00' WHERE `id` = 996332877

  def destroy
    @time_log = TimeLog.find(params[:id])
    @time_log.destroy
---
SELECT * FROM `time_logs` WHERE (`time_logs`.`id` = 996332879)
DELETE FROM `time_logs` WHERE `id` = 996332879