app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "updated_at", "login", "password", "email", "created_at") VALUES('Túlio', '2009-03-20 10:36:33', 'tulios', 'tulios', 'ocultokx@gmail.com', '2009-03-20 10:36:33')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2009-05-19 10:49:06', `login` = 'tulio', `name` = 'Túlio Ornelas', `email` = 'tulio.santos@seatecnologia.com.br' WHERE `id` = 1